## Import & Input

In [5]:
file_df = pd.read_csv("file.txt")

In [6]:
file_df

   name  class    roll  gpa
0   ram     12   45678  4.5
1  sita      9    2345  5.8
2  hari     10  618801  2.3

In [7]:
file_df.to_csv('data.csv')

In [8]:
# excel_data = pd.read_excel("excel_sample.xlsx")

## Read csv file pandas

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("salaries.csv")

In [3]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [10]:
df.sample(4)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
78209,78210,Robert E Collinson,EMT/Paramedic/Firefighter,116527.52,10339.97,10685.49,36659.37,137552.98,174212.35,2013,NaN,San Francisco,NaN
43995,43996,Lourdes Chan,Architectural Administrator,108953.05,0.00,0.00,41911.43,108953.05,150864.48,2012,NaN,San Francisco,NaN
119296,119297,Manisha Kothari,Utility Specialist,111556.84,0.00,0.00,36345.59,111556.84,147902.43,2014,NaN,San Francisco,NaN
29971,29972,BRENT MARQUARDT,GENERAL LABORER,15852.20,0.00,769.70,NaN,16621.90,16621.90,2011,NaN,San Francisco,NaN

## Average BasePay

In [12]:
 df['BasePay'].mean()

66325.4488404877

In [16]:
df[df['TotalPay']==df['TotalPay'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [15]:
df[df['EmployeeName']=='GARY JIMENEZ']['JobTitle']

1    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [32]:
years = df['Year'].value_counts()
years = years.index.tolist()
years

[2014, 2013, 2012, 2011]

In [35]:
df.groupby()

KeyError: 'Years'

In [34]:
for yer in years:
    print(yer)
    print(df[df['Year']==yer]['TotalPay'].mean())
    print()

2014
75463.91814023031

2013
77611.44314205181

2012
74113.26226513626

2011
71744.10387123538

110531    471952.64
110532    390111.98
110533    339653.70
110534    326716.76
110535    326233.44
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653      -618.13
Name: TotalPay, Length: 38123, dtype: float64